; domain
(define (domain assembler)
	(:requirements 
		:strips
		:typing
		)
	
	(:types 
		register
		index
		memory
		data
		)
   (:predicates
	(stores	    ?m - memory ?i - index ?d - data)
	(caches		?r - register ?d - data)
	(empty ?m - memory ?i - index)
   )
	(:action load                                
		:parameters (
		?m - memory    ?r - register ?i - index ?d ?garbage - data
		)

		:precondition (
		    and (stores ?m ?i ?d) (not (empty ?m ?i)) (caches ?r ?garbage )
         )

		:effect (
		    and (caches ?r ?d) (not (caches ?r ?garbage))
	    )
  
    )
	(:action empty                                
		:parameters (
		?m - memory  ?i - index ?d - data
		)

		:precondition (
		    and (stores ?m ?i ?d)
         )

		:effect (
		    and (not (stores ?m ?i ?d)) (empty ?m ?i)
	    )
  
    )
	(:action store                                
		:parameters (
		?m - memory  ?r - register ?i - index ?d - data
		)

		:precondition (
		    and (caches ?r ?d) (empty ?m ?i)
         )

		:effect (
		    and (stores ?m ?i ?d) (not (empty ?m ?i))
	    )
  
    )
)

; problem
(define	(problem assembler-1)
	(:domain assembler)
	(:objects
		reg1 reg2		                    - register
		i0 i1 i2 i3 i4 i5 i6 i7 i8 i9 		- index
	    mem                                 - memory
	    a b c d e f g h i j garbage         - data
		)
	(:init
	    (stores mem i0 j) (stores mem i1 i) (stores mem i2 h) (stores mem i3 g) (stores mem i4 f) (stores mem i5 e) (stores mem i6 d) (stores mem i7 c) (stores mem i8 b) (stores mem i9 a)
	    (caches reg1 garbage) (caches reg2 garbage)
	)
	(:goal
	    (and
	    (stores mem i0 a) (stores mem i1 b) (stores mem i2 c) (stores mem i3 d) (stores mem i4 e) (stores mem i5 f) (stores mem i6 g) (stores mem i7 h) (stores mem i8 i) (stores mem i9 j)
	    )
	)
)

; plan
1. (load mem reg1 i0 j garbage)
   deleted: (caches reg1 garbage)
   added: (caches reg1 j)
   goals met: 0 of 10
2. (load mem reg2 i9 a garbage)
   deleted: (caches reg2 garbage)
   added: (caches reg2 a)
   goals met: 0 of 10
3. (empty mem i0 j)
   deleted: (stores mem i0 j)
   added: (empty mem i0)
   goals met: 0 of 10
4. (store mem reg2 i0 a)
   deleted: (empty mem i0)
   added: (stores mem i0 a)
   goals met: 1 of 10
5. (load mem reg2 i1 i a)
   deleted: (caches reg2 a)
   added: (caches reg2 i)
   goals met: 1 of 10
6. (empty mem i1 i)
   deleted: (stores mem i1 i)
   added: (empty mem i1)
   goals met: 1 of 10
7. (empty mem i9 a)
   deleted: (stores mem i9 a)
   added: (empty mem i9)
   goals met: 1 of 10
8. (store mem reg1 i9 j)
   deleted: (empty mem i9)
   added: (stores mem i9 j)
   goals met: 2 of 10
9. (load mem reg1 i8 b j)
   deleted: (caches reg1 j)
   added: (caches reg1 b)
   goals met: 2 of 10
10. (store mem reg1 i1 b)
   deleted: (empty mem i1)
   added: (stores mem i1 b)
   goals met: 3 of 10
11. (load mem reg1 i2 h b)
   deleted: (caches reg1 b)
   added: (caches reg1 h)
   goals met: 3 of 10
12. (empty mem i2 h)
   deleted: (stores mem i2 h)
   added: (empty mem i2)
   goals met: 3 of 10
13. (empty mem i8 b)
   deleted: (stores mem i8 b)
   added: (empty mem i8)
   goals met: 3 of 10
14. (store mem reg2 i8 i)
   deleted: (empty mem i8)
   added: (stores mem i8 i)
   goals met: 4 of 10
15. (load mem reg2 i7 c i)
   deleted: (caches reg2 i)
   added: (caches reg2 c)
   goals met: 4 of 10
16. (store mem reg2 i2 c)
   deleted: (empty mem i2)
   added: (stores mem i2 c)
   goals met: 5 of 10
17. (load mem reg2 i3 g c)
   deleted: (caches reg2 c)
   added: (caches reg2 g)
   goals met: 5 of 10
18. (empty mem i3 g)
   deleted: (stores mem i3 g)
   added: (empty mem i3)
   goals met: 5 of 10
19. (empty mem i7 c)
   deleted: (stores mem i7 c)
   added: (empty mem i7)
   goals met: 5 of 10
20. (store mem reg1 i7 h)
   deleted: (empty mem i7)
   added: (stores mem i7 h)
   goals met: 6 of 10
21. (load mem reg1 i6 d h)
   deleted: (caches reg1 h)
   added: (caches reg1 d)
   goals met: 6 of 10
22. (store mem reg1 i3 d)
   deleted: (empty mem i3)
   added: (stores mem i3 d)
   goals met: 7 of 10
23. (load mem reg1 i4 f d)
   deleted: (caches reg1 d)
   added: (caches reg1 f)
   goals met: 7 of 10
24. (empty mem i4 f)
   deleted: (stores mem i4 f)
   added: (empty mem i4)
   goals met: 7 of 10
25. (empty mem i6 d)
   deleted: (stores mem i6 d)
   added: (empty mem i6)
   goals met: 7 of 10
26. (store mem reg2 i6 g)
   deleted: (empty mem i6)
   added: (stores mem i6 g)
   goals met: 8 of 10
27. (load mem reg2 i5 e g)
   deleted: (caches reg2 g)
   added: (caches reg2 e)
   goals met: 8 of 10
28. (store mem reg2 i4 e)
   deleted: (empty mem i4)
   added: (stores mem i4 e)
   goals met: 9 of 10
29. (empty mem i5 e)
   deleted: (stores mem i5 e)
   added: (empty mem i5)
   goals met: 9 of 10
30. (store mem reg1 i5 f)
   deleted: (empty mem i5)
   added: (stores mem i5 f)
   goals met: 10 of 10
